###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/ec2-user/environment/actions-runner/_work/_temp/713d79a0-6135-41c6-8654-5053edf76bd6/terraform-bin show -no-color tf1.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.acs730-webserver[0] has changed
  ~ resource "aws_instance" "acs730-webserver" {
        id                                   = "i-095da88bc2bf77023"
      ~ security_groups                      = [
          - "sg-04f921c20f5a5bb08",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerON"
            "env"   = "prod"
        }
        # (31 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730-webserver[1] has been deleted
  - resource "aws_instance" "acs730-webserver" {
      - ami                         = "ami-05034109c18473f00" -> null
      - associate_public_ip_address = true -> null
      - get_password_data           = false -> null
      - id                          = "i-03fdf1b5aacea0a68" -> null
      - instance_type               = "t2.micro" -> null
      - key_name                    = "prod" -> null
      - secondary_private_ips       = [] -> null
      - security_groups             = [
          - "sg-04f921c20f5a5bb08",
        ] -> null
      - source_dest_check           = true -> null
      - subnet_id                   = "subnet-01fa77e755c0fd0c4" -> null
      - tags                        = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerON"
          - "env"   = "prod"
        } -> null
      - tags_all                    = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerON"
          - "env"   = "prod"
        } -> null
      - user_data                   = "274615f8c80a14cd1f28d97ab6e7518cfa904190" -> null
      - user_data_replace_on_change = false -> null
      - vpc_security_group_ids      = [] -> null
    }

  # aws_instance.acs730-webserver[2] has changed
  ~ resource "aws_instance" "acs730-webserver" {
        id                                   = "i-0d54e70bd7dcff804"
      ~ security_groups                      = [
          - "sg-04f921c20f5a5bb08",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerOFF"
            "env"   = "prod"
        }
        # (30 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730-webserver[3] has been deleted
  - resource "aws_instance" "acs730-webserver" {
      - ami                         = "ami-05034109c18473f00" -> null
      - associate_public_ip_address = true -> null
      - get_password_data           = false -> null
      - id                          = "i-030c30c72eb63b97e" -> null
      - instance_type               = "t2.micro" -> null
      - key_name                    = "prod" -> null
      - secondary_private_ips       = [] -> null
      - security_groups             = [
          - "sg-04f921c20f5a5bb08",
        ] -> null
      - source_dest_check           = true -> null
      - subnet_id                   = "subnet-03c89a10359e9bfc0" -> null
      - tags                        = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerOFF"
          - "env"   = "prod"
        } -> null
      - tags_all                    = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerOFF"
          - "env"   = "prod"
        } -> null
      - user_data_replace_on_change = false -> null
      - vpc_security_group_ids      = [] -> null
    }

  # aws_instance.acs730gp[0] has changed
  ~ resource "aws_instance" "acs730gp" {
        id                                   = "i-0eb948947d36263fd"
      ~ security_groups                      = [
          - "sg-0c3176046364241bb",
        ]
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Private"
            "Owner" = "CAAacs730"
            "env"   = "prod"
        }
        # (29 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }

  # aws_instance.acs730gp[1] has been deleted
  - resource "aws_instance" "acs730gp" {
      - ami                         = "ami-05034109c18473f00" -> null
      - associate_public_ip_address = false -> null
      - get_password_data           = false -> null
      - id                          = "i-0ec02e18255f4481f" -> null
      - instance_type               = "t2.micro" -> null
      - key_name                    = "prod" -> null
      - secondary_private_ips       = [] -> null
      - security_groups             = [
          - "sg-0c3176046364241bb",
        ] -> null
      - source_dest_check           = true -> null
      - subnet_id                   = "subnet-03c6bb692718b471b" -> null
      - tags                        = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Private"
          - "Owner" = "CAAacs730"
          - "env"   = "prod"
        } -> null
      - tags_all                    = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Private"
          - "Owner" = "CAAacs730"
          - "env"   = "prod"
        } -> null
      - user_data_replace_on_change = false -> null
      - vpc_security_group_ids      = [] -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_instance.acs730-webserver[0] must be replaced
+/- resource "aws_instance" "acs730-webserver" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-095da88bc2bf77023" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-095da88bc2bf77023" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-064197f5f586d0501" -> (known after apply)
      ~ private_dns                          = "ip-10-1-1-69.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.1.69" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.87.140.87" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-04f921c20f5a5bb08",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerON"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-04f921c20f5a5bb08",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0f3b1268cfef79894" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730-webserver[1] will be created
  + resource "aws_instance" "acs730-webserver" {
      + ami                                  = "ami-05034109c18473f00"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-04f921c20f5a5bb08",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-01fa77e755c0fd0c4"
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Webserver"
          + "Owner" = "CAAacs730"
          + "Role"  = "WebServerON"
          + "env"   = "prod"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Webserver"
          + "Owner" = "CAAacs730"
          + "Role"  = "WebServerON"
          + "env"   = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "274615f8c80a14cd1f28d97ab6e7518cfa904190"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.acs730-webserver[1] (deposed object 22750171) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "acs730-webserver" {
      - ami                                  = "ami-05034109c18473f00" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0854d59cde898049a" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0854d59cde898049a" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "prod" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-012fabb1e50b29a6b" -> null
      - private_dns                          = "ip-10-1-2-233.ec2.internal" -> null
      - private_ip                           = "10.1.2.233" -> null
      - public_ip                            = "107.23.71.166" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-01fa77e755c0fd0c4" -> null
      - tags                                 = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerON"
          - "env"   = "prod"
        } -> null
      - tags_all                             = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerON"
          - "env"   = "prod"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "274615f8c80a14cd1f28d97ab6e7518cfa904190" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-04f921c20f5a5bb08",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0572f1d4ca1a566d5" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.acs730-webserver[2] must be replaced
+/- resource "aws_instance" "acs730-webserver" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0d54e70bd7dcff804" -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0d54e70bd7dcff804" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-01c1beff41a22f044" -> (known after apply)
      ~ private_dns                          = "ip-10-1-3-116.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.3.116" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.91.226.232" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-04f921c20f5a5bb08",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Webserver"
            "Owner" = "CAAacs730"
            "Role"  = "WebServerOFF"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-04f921c20f5a5bb08",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-025ab75e257f2c692" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730-webserver[3] will be created
  + resource "aws_instance" "acs730-webserver" {
      + ami                                  = "ami-05034109c18473f00"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-04f921c20f5a5bb08",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-03c89a10359e9bfc0"
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Webserver"
          + "Owner" = "CAAacs730"
          + "Role"  = "WebServerOFF"
          + "env"   = "prod"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Webserver"
          + "Owner" = "CAAacs730"
          + "Role"  = "WebServerOFF"
          + "env"   = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.acs730-webserver[3] (deposed object ca70a025) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "acs730-webserver" {
      - ami                                  = "ami-05034109c18473f00" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-067afe5e261297fd8" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-067afe5e261297fd8" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "prod" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0b6c80f9f8c1a4ce7" -> null
      - private_dns                          = "ip-10-1-4-84.ec2.internal" -> null
      - private_ip                           = "10.1.4.84" -> null
      - public_ip                            = "54.242.83.135" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-03c89a10359e9bfc0" -> null
      - tags                                 = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerOFF"
          - "env"   = "prod"
        } -> null
      - tags_all                             = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Webserver"
          - "Owner" = "CAAacs730"
          - "Role"  = "WebServerOFF"
          - "env"   = "prod"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-04f921c20f5a5bb08",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e07d275218bdc609" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.acs730gp[0] must be replaced
+/- resource "aws_instance" "acs730gp" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0eb948947d36263fd" -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0eb948947d36263fd" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-014c295996e14381b" -> (known after apply)
      ~ private_dns                          = "ip-10-1-5-65.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.5.65" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0c3176046364241bb",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "App"   = "Web"
            "Name"  = "prod-Amazon-Linux-Private"
            "Owner" = "CAAacs730"
            "env"   = "prod"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0c3176046364241bb",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ cpu_options {
          + amd_sev_snp      = (known after apply)
          ~ core_count       = 1 -> (known after apply)
          ~ threads_per_core = 1 -> (known after apply)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_protocol_ipv6          = "disabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0c945e24e9c8f03a7" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.acs730gp[1] will be created
  + resource "aws_instance" "acs730gp" {
      + ami                                  = "ami-05034109c18473f00"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-0c3176046364241bb",
        ]
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-03c6bb692718b471b"
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Private"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Private"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.acs730gp[1] (deposed object ec15a2e7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "acs730gp" {
      - ami                                  = "ami-05034109c18473f00" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-00d4134c57cdf4ef7" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-00d4134c57cdf4ef7" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "prod" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0a83e66b1a7d879bd" -> null
      - private_dns                          = "ip-10-1-6-191.ec2.internal" -> null
      - private_ip                           = "10.1.6.191" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-03c6bb692718b471b" -> null
      - tags                                 = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Private"
          - "Owner" = "CAAacs730"
          - "env"   = "prod"
        } -> null
      - tags_all                             = {
          - "App"   = "Web"
          - "Name"  = "prod-Amazon-Linux-Private"
          - "Owner" = "CAAacs730"
          - "env"   = "prod"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0c3176046364241bb",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-05b736ec023ece0ff" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_key_pair.web_key must be replaced
+/- resource "aws_key_pair" "web_key" {
      ~ arn             = "arn:aws:ec2:us-east-1:775273113262:key-pair/prod" -> (known after apply)
      ~ fingerprint     = "60:78:16:5b:19:2d:0b:cb:75:7a:e8:b0:df:7f:fc:e2" -> (known after apply)
      ~ id              = "prod" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-05bd09d67b1020d7c" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      ~ public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDRDRTdspsY3pfSP3apSgN8d25U+Tab9bdYNh9HKK1hOIHMUf0F2GvF47141re53O0kAMaQwU0sMu3XoGfeVkTfuHbYq1w8mJVhLby9/aYGKKLWNWkvhw3FWdUc2U1vIuHzKtcquNKBvI5m51qOWKwum8yOQHHYcmqk8jMgOyHFk5urTAqP75iT52ph063GSQYihvm4K8vKWVU/AIQC7sf0Rezejfvpcw5Pqxr364yuf7ezjkRovBffqUid5iiAxDH9SaTMBNVX0pPqPXtKANi5pOnMO08wQ1YOmIN9etFwjm9BaW7Gbj7/J+D2z5b/LpxhBIkhZ4cAZnGY/irnNAVl ec2-user@ip-172-31-85-39.ec2.internal" -> "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC3iU9PXLB6sezNi8oKC6vyePBHTLO+W/3FC4la4WUIOyhdRXVtsrpHpGjWWQTk2hjhPOVWADLJa2P7uRclyrlkzkA2hLIg7wX5S/DK/6GttIFAbnGVBCOsVcpHJF0p1Oulj7NNZTcbf7zwUnhwCeaQmbG5Obfn+pIZJyepOLbPLqad2vNNQt9M87/clhir7GZwGC3tftKxs5Npyi51LbW7Vi/foAbZKkyGpogPet59ymQknyWUIA2kIhpxxhclcKYFJrTCaIqBUa4engux3OwKUPjyBhpEc4TXOkW7DeRjDIWPvkk4TVRgCVepeHV7CKNNQLhv81dnDm5YDEabr2q/ ec2-user@ip-172-31-85-39.ec2.internal" # forces replacement
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.acs730-webserver[0] has changed%0A  ~ resource "aws_instance" "acs730-webserver" {%0A        id                                   = "i-095da88bc2bf77023"%0A      ~ security_groups                      = [%0A          - "sg-04f921c20f5a5bb08",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerON"%0A            "env"   = "prod"%0A        }%0A        # (31 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs730-webserver[1] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                         = "ami-05034109c18473f00" -> null%0A      - associate_public_ip_address = true -> null%0A      - get_password_data           = false -> null%0A      - id                          = "i-03fdf1b5aacea0a68" -> null%0A      - instance_type               = "t2.micro" -> null%0A      - key_name                    = "prod" -> null%0A      - secondary_private_ips       = [] -> null%0A      - security_groups             = [%0A          - "sg-04f921c20f5a5bb08",%0A        ] -> null%0A      - source_dest_check           = true -> null%0A      - subnet_id                   = "subnet-01fa77e755c0fd0c4" -> null%0A      - tags                        = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                    = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - user_data                   = "274615f8c80a14cd1f28d97ab6e7518cfa904190" -> null%0A      - user_data_replace_on_change = false -> null%0A      - vpc_security_group_ids      = [] -> null%0A    }%0A%0A  # aws_instance.acs730-webserver[2] has changed%0A  ~ resource "aws_instance" "acs730-webserver" {%0A        id                                   = "i-0d54e70bd7dcff804"%0A      ~ security_groups                      = [%0A          - "sg-04f921c20f5a5bb08",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "prod-Amazon-Linux-Webserver"%0A            "Owner" = "CAAacs730"%0A            "Role"  = "WebServerOFF"%0A            "env"   = "prod"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs730-webserver[3] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                         = "ami-05034109c18473f00" -> null%0A      - associate_public_ip_address = true -> null%0A      - get_password_data           = false -> null%0A      - id                          = "i-030c30c72eb63b97e" -> null%0A      - instance_type               = "t2.micro" -> null%0A      - key_name                    = "prod" -> null%0A      - secondary_private_ips       = [] -> null%0A      - security_groups             = [%0A          - "sg-04f921c20f5a5bb08",%0A        ] -> null%0A      - source_dest_check           = true -> null%0A      - subnet_id                   = "subnet-03c89a10359e9bfc0" -> null%0A      - tags                        = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                    = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - user_data_replace_on_change = false -> null%0A      - vpc_security_group_ids      = [] -> null%0A    }%0A%0A  # aws_instance.acs730gp[0] has changed%0A 
  ```
  </details>
  *Pusher: @Gaurav-17, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*